/*
    Лабораторна робота № 2
  Програмування лінійних алгоритмів
Мета роботи : набути практичних навиків записування арифметичних виразів мовою С++ і створення програмних проектів лінійної структури в Visual
С++
   Питання та відповіді
1) Який процес називають лінійним?
Відповідь:Такий, який виконується один за одним.
2) Які стандартні типи даних С++ Вам відомі?
Відповідь: int, float, char, bool. 
3) Яких значень набудуть змінні j та i після обчислення для int j, i=2;
 а) j = i++ + i++;  в) j = i++ + ++i;
 б) j = ++i + ++i;  г) j = ++i + i--;
 Відповідь: а) j = 5; б)j = 7; в)j = 6; г)j = 5;
4) Запишіть константу 0.2731е3 у фіксованому форматі.
Відповідь:  const float x = 0.2731e3.
5) Запишіть число 0.0001 в експоненційній формі з рухомою крапкою.
Відповідь: const float x = 1.0e-4;
6) Запишіть вираз y = pow(x*3) + sin 2*x засобами с++.
Відповідь: y = pow(x*3) + sin(2*x)
7) Якого значення набуде змінна y після обчислення:
 а) y = (1 + 2) / (3 + 2); в) y = 1 + 2.0 / 3 + 2;
 б) y = 1 + 2 / 3 + 2; г) y = (1 + 2) / (3.0 + 2)
 Відповідь: а)y = 0.6; б)y = 3.6667 ;в)y = 3.6667 );г)y = 0.6 .
*/
#include <iostream>
int main() {
    setlocale(LC_ALL, "uk_UA");
    //Я ХЗ ЯК ПИСАТИ ОТІ ФОРМУЛИ
    return 0;
}