/*
            Лабораторна робота № 1
         Знайомство з Visual C++. Способи введення-виведення даних
 Мета роботи: ознайомитися з інтерфейсом Microsoft Visual C++ – інтегрованого середовища розробки програм мовою C++ та набути навиків створювання та налагоджування програмних проектів.
      Питання та завдання для самоконтролю
1) Назвіть різні засоби створювання програмних проектів у Visual С++.
Відповідь: win32, Windows Forms,  CLR.
2) Що таке консольна програма?
Відповідь: така яка компілюється у консольних середовищах.
3) Назвіть послідовність створювання консольного проекту в Visual C++.
Відповідь: відкрити меню нового проекту => створити новий проект як консольний додаток => вибрати директорію де буде новий проект => натиснути create.
4) Які функції введення-виведення даних у консольному режимі Вам відомі?
Відповідь: cout, cin.
5) За допомогою якої директиви до програми долучають бібліотечні модулі (заголовні файли)?
Відповідь: #include.
6) Які заголовні файли слід долучити для використання функцій введення-виведення?
Відповідь: <iostream>
7) В які способи можна запустити проект на виконання?
Відповідь: ctrl + f5.
8) В який спосіб можна зберегти програмний проект?
Відповідь: save.
*/
#include <iostream>

int main() {
    setlocale(LC_ALL, "uk_UA");
        std::cout << "Привіт Світ";
    return 0;
}